<!DOCTYPE html>


<html dir = rtl>

  
<head>
<title> the boeuty of natural hair </title>

<link rel="stylesheet" href= "sttyy.css">
<style>
 body{
      background-color: #f3f3f3;
      font-family: arial;
    }
	</style>
</head>
 

<div class="body">
<body>
<h1> الشعر هو تاج الجمال، ولا توجد أنثى لا تهتم بشعرها وبجماله ورونقه. </h1>
<h2> نصائح عامة للحصول على شعر قوى وغير تالف   </h2>
<ul> 
<li>دلكي فروة شعرك كل ليلة , التدليك يزيد من عوامل قوة الشعر وحمايته من التلف.</li>
<li>تذكري دائمًا أن تقصي أطراف الشعر بانتظام حيث أنها ستقضي على مشكلة الأطراف المتقصفة وتحد من تطورها. </li>
<li> تأكدي من حصولك أيضًا على عناصر الحديد والزنك والسيلينيوم فإن تواجدهم في نظامك الغذائي مهم للحفاظ على قوة شعرك .</li>
<li> تجنبي استخدام الفرشاة ذات الأسنان البلاستيكية. </li>
<li>تجنبي عمل تسريحات الشعر المشدودة، وخاصة أثناء النوم. </li>
<li>تجنبي استخدام الحرارة على الشعر قدر الامكان. </li>

<h2> حقائق عن الشعر</h2>
<li> يتراوح متوسط عدد الشعر المتساقط من فروة الرأس ما بين ٥٠ -١٥٠ شعرة في اليوم الواحد.</li>
<li> الأشخاص الذين يمتلكون شعرا أحمر اللون نادرون جدا في العالم. </li>
<li> متوسط عمر كل شعرة يتراوح بين ٤-٧ سنوات. </li>
<li>الإضطرابات التي تحدث في الهرمونات والخسارة المفاجئة في الوزن قد يتسببان في تساقط الشعر. </li>
<li> لا أحد بالعالم يمتلك شعر تام الإستقامة وإنما لابد من ميل وإنحراف بالشعر ولكن بمقدار مختلف من شخص لأخر.</li>
<li> متوسط عدد الشعيرات في فروة الرأس حوالي 100.000 شعرة. </li>
</ul> 

 <button class = "button" type="button"><a href = "problem.php" > العودة </a> </button>


</ul>
</div>
</body>

</html>
